app/Http/Controllers/Api/ProductController.php

select * from `products` where `title` like '%%' and `products`.`deleted_at` is null order by `updated_at` desc limit 10 offset 0
select count(*) as aggregate from `products` where `title` like '%%' and `products`.`deleted_at` is null
---
    public function index()
    {
        $perPage = request('per_page', 10);
        $search = request('search', '');
        $sortField = request('sort_field', 'updated_at');
        $sortDirection = request('sort_direction', 'desc');

        $query = Product::query()
            ->where('title', 'like', "%{$search}%")
            ->orderBy($sortField, $sortDirection)
            ->paginate($perPage);

insert into `products` (`title`, `price`, `quantity`, `description`, `published`, `created_by`, `updated_by`, `slug`, `updated_at`, `created_at`) values ('test', '1', '', '<p>test</p>', 0, 1, 1, 'test', '2024-10-21 18:02:35', '2024-10-21 18:02:35')
---
    public function store(ProductRequest $request)
    {
        $data = $request->validated();
        $data['created_by'] = $request->user()->id;
        $data['updated_by'] = $request->user()->id;

        /** @var \Illuminate\Http\UploadedFile $image */
        $image = $data['image'] ?? null;
        // Check if image was given and save on local file system
        if ($image) {
            $relativePath = $this->saveImage($image);
            $data['image'] = URL::to(Storage::url($relativePath));
            $data['image_mime'] = $image->getClientMimeType();
            $data['image_size'] = $image->getSize();
        }

        $product = Product::create($data);