app/Helpers/Cart.php

select sum(`quantity`) as aggregate from `cart_items` where `user_id` = 1
---
    public static function getCartItemsCount(): int
    {
        $request = \request();
        $user = $request->user();
        if ($user) {
            return CartItem::where('user_id', $user->id)->sum('quantity');