app/Http/Controllers/AuthController.php

    public function logout()
    {
        /** @var \App\Models\User $user */
        $user = Auth::user();
        $user->currentAccessToken()->delete();
---
delete from `personal_access_tokens` where `id` = 8